app/controllers/bonificacions_controller.rb

SELECT `bonificacions`.* FROM `bonificacions`  ORDER BY @bonificacions.categorium_id
---
  def index
    @bonificacions = Bonificacion.order("@bonificacions.categorium_id")

INSERT INTO `bonificacions` (`detalle_bono`, `bono`, `subcategorium_id`, `created_at`, `updated_at`) VALUES ('Trabajador del mes', 35000, 4, '2016-10-03 14:28:06', '2016-10-03 14:28:06')
---
  def create
    @bonificacion = Bonificacion.new(bonificacion_params)

    respond_to do |format|
      if @bonificacion.save

DELETE FROM `bonificacions` WHERE `bonificacions`.`id` = 12
---
  def destroy
    @bonificacion.destroy

SELECT  `bonificacions`.* FROM `bonificacions` WHERE `bonificacions`.`id` = 12 LIMIT 1
---
    def set_bonificacion
      @bonificacion = Bonificacion.find(params[:id])