app/views/liquidacions/_form.html.erb

SELECT `personals`.* FROM `personals`
---
    <%= f.label :personal_id %><br>
    <%= collection_select(:liquidacion, :personal_id, Personal.all, :id, :nombre_apellido, {:prompt => 'Seleccione trabajador'}) %>